In [1]:
%load_ext sql
%sql sqlite://

/Library/Python/2.7/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/Library/Python/2.7/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

'Connected: None@None'

In [2]:
%%sql
DROP TABLE IF EXISTS Person;
CREATE TABLE Person (name TEXT, age INT, height INT, weight INT);
INSERT INTO Person VALUES ('Anna', 20, NULL, 200);
INSERT INTO Person VALUES ('Sophia', NULL, 64, 150);
INSERT INTO Person VALUES ('David', 10, 48, 90);

Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [3]:
%sql SELECT * FROM Person;

Done.

[(u'Anna', 20, None, 200), (u'Sophia', None, 64, 150), (u'David', 10, 48, 90)]

### Example 1: does not return the 1st row because of NULL height value

Does not return other rows either!

In [8]:
%%sql SELECT * 
FROM Person
WHERE age < 25
AND height > 60
AND weight > 190;

Done.

[]

### Example 1b: now _does_ return the 1st row

Does not return other rows either!

In [10]:
%%sql SELECT * 
FROM Person
WHERE age < 25
AND (height > 60 OR weight > 190);

Done.

[(u'Anna', 20, None, 200)]

### Example 2: does not return 2nd row because of NULL age value

In [11]:
%%sql SELECT *
FROM PERSON
WHERE age < 25
OR age >= 25;

Done.

[(u'Anna', 20, None, 200), (u'David', 10, 48, 90)]

### Fix (we now get all the rows as expected!):

In [12]:
# TODO - rewrite the above query to get the None valued rows as well

Done.

[(u'Anna', 20, None, 200), (u'Sophia', None, 64, 150), (u'David', 10, 48, 90)]

In [13]:
%%sql
DROP TABLE IF EXISTS Product;
CREATE TABLE Product (name TEXT, category TEXT);
INSERT INTO Product VALUES ('Toothbrush', 'Toiletries');
INSERT INTO Product VALUES ('Skittles', 'Candy');
INSERT INTO Product VALUES ('Teddy bear', 'Toys');

DROP TABLE IF EXISTS Purchase;
CREATE TABLE Purchase (prodName TEXT, store TEXT);
INSERT INTO Purchase VALUES ('Skittles', 'Walgreens');
INSERT INTO Purchase VALUES ('Teddy bear', 'ToysRUs');

Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.

[]

### Example 3: We want to get all the data from both tables and combine the information of those with the same product. However, an inner join on two tables results in a lost row (purchase tuple does not exist):

In [14]:
%%sql SELECT Product.name, Purchase.store
FROM Product 
JOIN Purchase
ON Product.name = Purchase.prodName

Done.

[(u'Skittles', u'Walgreens'), (u'Teddy bear', u'ToysRUs')]

### Fix: Use a left outer join instead:

In [15]:
%%sql SELECT Product.name, Purchase.store
FROM Product
LEFT OUTER JOIN Purchase
ON Product.name = Purchase.prodName

Done.

[(u'Toothbrush', None),
 (u'Skittles', u'Walgreens'),
 (u'Teddy bear', u'ToysRUs')]

In [16]:
%%sql
DROP TABLE IF EXISTS Example;
CREATE TABLE Example (flag1 INT, flag2 INT);
INSERT INTO Example VALUES(0, 1);
INSERT INTO Example VALUES(1, 0);
INSERT INTO Example VALUES(1, 1);
INSERT INTO Example VALUES(NULL, 1);
INSERT INTO Example VALUES(0, NULL);

Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%sql SELECT * FROM Example;

Done.

[(0, 1), (1, 0), (1, 1), (None, 1), (0, None)]

### Exercise: Use the table above ('Example') to experiment with different WHERE clauses, like below.

In [18]:
%%sql SELECT * FROM Example
WHERE flag1 = 0 
OR flag2 = 0

Done.

[(0, 1), (1, 0), (0, None)]